<?php
//配置文件
return [
    // +----------------------------------------------------------------------
    // | auth 认证配置
    // +----------------------------------------------------------------------
    'auth'  => [
        'auth_on'           => 1, // 权限开关
        'auth_type'         => 1, // 认证方式，1为实时认证；2为登录认证。
        'auth_group'        => 'auth_group', // 用户组数据不带前缀表名
        'auth_group_access' => 'auth_group_access', // 用户-用户组关系不带前缀表名
        'auth_rule'         => 'auth_rule', // 权限规则不带前缀表名
        'auth_user'         => 'admin', // 用户信息不带前缀表名
    ],
    // +----------------------------------------------------------------------
    // | 其他相关
    // +----------------------------------------------------------------------
    'default_return_type'   =>  'json',
    'pwd_prefix'            =>  'M7UTCeVR&N0Tietp',
    'web_title'             =>  '爬虫系统',
    // +----------------------------------------------------------------------
    // | 菜单导航
    // +----------------------------------------------------------------------
    'nav_menu'  =>  [
        [
            'name'      =>  '系统管理',
            'icon'      =>  '&#xe61d;',
            'auth'      =>  'admin/index,auth/group_list',
            'child'     =>  [
                [
                    'name'  =>  '管理员',
                    'url'   =>  'admin/index',
                ],
                [
                    'name'  =>  '权限管理',
                    'url'   =>  'auth/group_list',
                ],
            ]
        ],
    ],
];